#pragma once

// ================= События кнопок =================
enum class ButtonEvent {
    PRESSED,    // палец только что коснулся
    RELEASED,   // палец отпущен
    HELD        // палец удерживается (для долгих нажатий)
};

// Тип функции-обработчика кнопки
using ButtonCallback = void(*)(ButtonEvent event);

// ================= События касания экрана =================
enum class TouchEvent {
    PRESSED,    // палец только что коснулся экрана
    RELEASED,   // палец только что отпущен
    NONE        // ничего не изменилось (палец держится или отсутствует)
};